Mermaid Implementasyon
